_posts/programming/2022-10-30-cppcoreguidelines-c64.html
---
layout: post
title: CppCoreGuidelines C.64 移动操作应该移动，并确保留下的数据状态有效
categories: [programming]
tags: [CppCoreGuidelines]
---
<p>
<a href="http://kimi.im/tags.html#CppCoreGuidelines-ref">C++ 核心指南目录</a>
</p>

<p>
C.64: A move operation should move and leave its source in a valid state
</p>

<p>
<b>理由</b>
</p>

<p>
在<code>y = std::move(x)</code>操作后， <code>y</code> 的值应该变成 <code>x</code> 的值， <code>x</code> 应该保持一个有效的状态。
</p>


<p>
<b>例子</b>
</p>

<div class="org-src-container">
<pre class="src src- src-C++"><span style="color: #7F0055; font-weight: bold;">class</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">X</span> <span style="color: #707183;">{</span>   <span style="color: #3F7F5F;">// OK: value semantics</span>
<span style="color: #7F0055; font-weight: bold;">public</span>:
    <span style="color: #0000ff; font-weight: bold;">X</span><span style="color: #7388d6;">()</span>;
    <span style="color: #0000ff; font-weight: bold;">X</span><span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">X</span><span style="color: #7F0055; font-weight: bold;">&amp;&amp;</span> <span style="color: #000000;">a</span><span style="color: #7388d6;">)</span> <span style="color: #7F0055; font-weight: bold;">noexcept</span>;  <span style="color: #3F7F5F;">// move X</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">X</span><span style="color: #7F0055; font-weight: bold;">&amp;</span> operator<span style="color: #7F0055; font-weight: bold;">=</span><span style="color: #7388d6;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">X</span><span style="color: #7F0055; font-weight: bold;">&amp;&amp;</span> <span style="color: #000000;">a</span><span style="color: #7388d6;">)</span> <span style="color: #7F0055; font-weight: bold;">noexcept</span>; <span style="color: #3F7F5F;">// move-assign X</span>
    <span style="color: #7F0055; font-weight: bold;">void</span> <span style="color: #0000ff; font-weight: bold; font-style: italic;">modify</span><span style="color: #7388d6;">()</span>;     <span style="color: #3F7F5F;">// change the value of X</span>
    <span style="color: #3F7F5F;">// ...</span>
    <span style="color: #7F0055; font-weight: bold;">~</span><span style="color: #110099;">X</span><span style="color: #7388d6;">()</span> <span style="color: #7388d6;">{</span> <span style="color: #7F0055; font-weight: bold;">delete</span><span style="color: #909183;">[]</span> p; <span style="color: #7388d6;">}</span>
<span style="color: #7F0055; font-weight: bold;">private</span>:
    <span style="color: #000000; font-style: italic; text-decoration: underline;">T</span><span style="color: #7F0055; font-weight: bold;">*</span> <span style="color: #000000; font-style: italic;">p</span>;
    <span style="color: #7F0055; font-weight: bold;">int</span> <span style="color: #000000; font-style: italic;">sz</span>;
<span style="color: #707183;">}</span>;

<span style="color: #000000; font-style: italic; text-decoration: underline;">X</span>::<span style="color: #0000ff; font-weight: bold;">X</span><span style="color: #707183;">(</span><span style="color: #000000; font-style: italic; text-decoration: underline;">X</span><span style="color: #7F0055; font-weight: bold;">&amp;&amp;</span> <span style="color: #000000;">a</span><span style="color: #707183;">)</span> <span style="color: #7F0055; font-weight: bold;">noexcept</span>
    :<span style="color: #110099; font-style: italic;">p</span><span style="color: #707183;">{</span>a.<span style="color: #110099; font-style: italic;">p</span><span style="color: #707183;">}</span>, <span style="color: #110099; font-style: italic;">sz</span><span style="color: #707183;">{</span>a.<span style="color: #110099; font-style: italic;">sz</span><span style="color: #707183;">}</span>  <span style="color: #3F7F5F;">// steal representation</span>
<span style="color: #707183;">{</span>
    a.<span style="color: #000000; font-style: italic;">p</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #110099; font-weight: bold;">nullptr</span>;     <span style="color: #3F7F5F;">// set to "empty"</span>
    a.<span style="color: #000000; font-style: italic;">sz</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #110099;">0</span>;
<span style="color: #707183;">}</span>

<span style="color: #7F0055; font-weight: bold;">void</span> <span style="color: #0000ff; font-weight: bold;">use</span><span style="color: #707183;">()</span>
<span style="color: #707183;">{</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">X</span> <span style="color: #000000;">x</span><span style="color: #7388d6;">{}</span>;
    <span style="color: #3F7F5F;">// ...</span>
    <span style="color: #000000; font-style: italic; text-decoration: underline;">X</span> <span style="color: #000000;">y</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">std</span>::<span style="color: #3a5fcd; font-weight: bold;">move</span><span style="color: #7388d6;">(</span>x<span style="color: #7388d6;">)</span>;
    <span style="color: #000000;">x</span> <span style="color: #7F0055; font-weight: bold;">=</span> <span style="color: #000000; font-style: italic; text-decoration: underline;">X</span><span style="color: #7388d6;">{}</span>;   <span style="color: #3F7F5F;">// OK</span>
<span style="color: #707183;">}</span> <span style="color: #3F7F5F;">// OK: x can be destroyed</span>
</pre>
</div>


<p>
<b>注意</b>
</p>

<p>
理想情况下，被移动掉数据的对象，它的值应该是默认数据值。如果你不想这样，你得有一个充足的理由。但是，并不是所有类型都有一个默认值，而且有些类型恢复默认值的系统开销会比较高。所以，标准只要求销毁掉被移动的对象。通常，我们可以很容易很轻松的做的更好：标准库还假设，我们可以继续给被移动掉的对象赋值。请确保，被移动掉的对象保持一个有效的状态。
</p>


<p>
<b>注意</b>
</p>

<p>
请确保这么操作是合法的：<code>x = std::move(y); y = z;</code>除非有很强烈的特殊理由违反本指南。
</p>


<p>
<b>强化</b>
</p>
<ul class="org-ul">
<li>检查对成员赋值的移动操作。如果有默认的构造函数，请比较成员赋值与默认构造函数中的初始化。</li>
</ul>
